do local function run(msg, matches) if is_momod(msg) and matches[1]== "he2" then return [[ 🚸❗️ #اوامر_حماية_المجموعة 📮
✵•┈••●◆💈◆●••┈•✵
📍 /lk|nlk links :- الروابط 📧
🚩 /lk|nlk fwd :- التوجيه 🔃
📍 /lk|nlk audio :- الصوتيات 🗣
🚩 /lk|nlk photo :- الصور 🎡
📍 /lk|nlk video :- الفيديو 🎥
🚩 /lk|nlk gifs :- الصور المتحركة 🖥
📍 /lk|nlk doc :- الملفات 🗂
🚩 /lk|nlk text :- الدردشه 📝
📍 /lk|nlk flood :- التكرار ♻️
🚩 /lk|nlk spam :- الكلايش 📖
📍 /lk|nlk sticker :- الملصقات 😀
🚩 /lk|nlk member :- الاضافة 👤
📍 /lk|nlk contacts :- الجهات 👥
🚩 /lk|nlk tgservice :- اشعارات دخول 🚶🏻
📍 /lk|nlk arabic :- العربية 🆎
🚩 /lk|nlk english :- الانكليزية 🔠
📍 /lk|nlk bots :- البوتات 🤖
🚩 /lk|nlk rtl :- الرتل 🈂
📍 /lk|nlk tag :- الاشارة 🚻
🚩 /lk|nlk join :- الدخول برابط ♿️
📍 /lk|nlk reply :- الردود ↩️
🚩 /lk|nlk emoji :- السمايلات 😀
📍 /lk|nlk username :- المعرف @
🚩 /lk|nlk media :- الميديا ⛽️
📍 /lk|nlk strict :- الحماية 🛡
🚩/lk|nlk badwors :- الكلمات السيئة 🔞
📍/lk|nlk leave :- المغادرة 🚷
🚩/lk|nlk all :- قفل جميع الوسائط ⛔️
✵•┈••●◆💈◆●••┈•✵
#ملاحظة : تعمل جميع الاوامر ـبـ  ⇣
🔘 /lk   ::   امر القفل 
☑️ /nlk   ::   امر الفتح 
✵•┈••●◆💈◆●••┈•✵
- DEV - @IQ_ABS   📌
- Channel - @DEV_PROX ]] end if not is_momod(msg) then return "للمشرفين فقط ⛔️😴✋🏿" end end return { description = "Help list", usage = "Help list", patterns = { "[#!/](he2)" }, run = run } end 
