do 

function run(msg, matches) 
return [[ 
أوامر أضافية يمكن للعضو استخدامها 📮👤

✵•┈••●◆ ⚗ ◆●••┈•✵

🔹/weather + لمعرفة الطقس :- 💭 الطقس
🔹/azan + لمعرفة الاذان :- 💭 المنطقة 
🔹/tr + للترجمة :- 💭 الكلمة 
🔹/time + لمعرفة الوقت :- 💭 المنطقة
🔹/image :- 💭 لتحويل ملصق الى صورة 
🔹/sticker :- 💭 لتحويل صورة الى ملصق 
🔹/text + لتحويل نص الى صورة :- 💭 النص
🔹/re + لتكرار الكلمة :- 💭 الكلمة
🔹/tagall :- 💭 لعمل اشارة للجميع 
🔹/write + لزخرفة الكلمات :- 💭 الكلمة انكلش 
🔹/voice + لتحويل النص الى صوت :- 💭 النص 
✵•┈••●◆ ⚗ ◆●••┈•✵ 
- DEV - @IQ_ABS   📌
- Channel - @DEV_PROX
]] 
end 

return { 
description = "Shows bot q", 
usage = "help Shows bot q", 
patterns = { 
"/he4$" 
}, 
run = run 
} 
end 
